TexasInstruments/mcupsdk-core/examples/industrial_comms/ethercat_iolink_gateway_demo/am243x-lp/r5fss0-0_freertos/example.syscfg
gpio6.$name                = "CONFIG_IOL_TX6";
gpio6.pinDir               = "OUTPUT";
gpio6.GPIO.gpioPin.rx      = false;
gpio6.GPIO.gpioPin.$assign = "ball.N3";

gpio7.$name                = "CONFIG_IOL_TX7";
gpio7.pinDir               = "OUTPUT";
gpio7.GPIO.gpioPin.$assign = "ball.E1";

gpio8.$name                = "CONFIG_IOL_TX8";
gpio8.pinDir               = "OUTPUT";
gpio8.GPIO.gpioPin.rx      = false;
gpio8.GPIO.gpioPin.$assign = "ball.K4";

gpio9.$name                = "CONFIG_IOL_RX1";
gpio9.GPIO.gpioPin.$assign = "ball.J3";

gpio10.$name                = "CONFIG_IOL_RX2";
gpio10.GPIO.gpioPin.$assign = "ball.J4";

gpio11.$name                = "CONFIG_IOL_RX3";
gpio11.GPIO.gpioPin.$assign = "ball.G1";

gpio12.$name                = "CONFIG_IOL_RX4";
gpio12.GPIO.gpioPin.$assign = "ball.H1";

gpio13.$name                = "CONFIG_IOL_RX5";
gpio13.GPIO.gpioPin.$assign = "ball.K2";

gpio14.$name                = "CONFIG_IOL_RX6";
gpio14.GPIO.gpioPin.$assign = "ball.F2";

gpio15.$name                = "CONFIG_IOL_RX7";
gpio15.GPIO.gpioPin.$assign = "ball.H2";

gpio16.$name                = "CONFIG_IOL_RX8";
gpio16.GPIO.gpioPin.$assign = "ball.E2";

gpio17.$name                = "CONFIG_IOL_TXEN1";
gpio17.pinDir               = "OUTPUT";
gpio17.GPIO.gpioPin.rx      = false;
gpio17.GPIO.gpioPin.$assign = "ball.M4";

gpio18.$name                = "CONFIG_IOL_TXEN2";
gpio18.pinDir               = "OUTPUT";
gpio18.GPIO.gpioPin.rx      = false;
gpio18.GPIO.gpioPin.$assign = "ball.T3";

gpio19.$name                = "CONFIG_IOL_TXEN3";
gpio19.pinDir               = "OUTPUT";
gpio19.GPIO.gpioPin.rx      = false;
gpio19.GPIO.gpioPin.$assign = "ball.E4";

gpio20.$name                = "CONFIG_IOL_TXEN4";
gpio20.pinDir               = "OUTPUT";
gpio20.GPIO.gpioPin.rx      = false;
gpio20.GPIO.gpioPin.$assign = "ball.D2";

gpio21.$name                = "CONFIG_IOL_TXEN5";
gpio21.pinDir               = "OUTPUT";
gpio21.GPIO.gpioPin.rx      = false;
gpio21.GPIO.gpioPin.$assign = "ball.A8";

gpio22.$name                = "CONFIG_IOL_TXEN6";
gpio22.pinDir               = "OUTPUT";
gpio22.GPIO.gpioPin.rx      = false;
gpio22.GPIO.gpioPin.$assign = "ball.T2";

gpio23.$name                = "CONFIG_IOL_TXEN7";
gpio23.pinDir               = "OUTPUT";
gpio23.GPIO.gpioPin.rx      = false;
gpio23.GPIO.gpioPin.$assign = "ball.Y4";

gpio24.$name                = "CONFIG_IOL_TXEN8";
gpio24.pinDir               = "OUTPUT";
gpio24.GPIO.gpioPin.rx      = false;
gpio24.GPIO.gpioPin.$assign = "ball.U3";

gpio25.$name                = "CONFIG_IOL_ENL1";
gpio25.pinDir               = "OUTPUT";
gpio25.GPIO.gpioPin.rx      = false;
gpio25.GPIO.gpioPin.$assign = "ball.G2";

gpio26.$name                = "CONFIG_IOL_ENL2";
gpio26.pinDir               = "OUTPUT";
gpio26.GPIO.gpioPin.rx      = false;
gpio26.GPIO.gpioPin.$assign = "ball.L5";

gpio27.$name                = "CONFIG_IOL_ENL3";
gpio27.pinDir               = "OUTPUT";
gpio27.GPIO.gpioPin.rx      = false;
gpio27.GPIO.gpioPin.$assign = "ball.J2";

gpio28.$name                = "CONFIG_IOL_ENL4";
gpio28.pinDir               = "OUTPUT";
gpio28.GPIO.gpioPin.rx      = false;
gpio28.GPIO.gpioPin.$assign = "ball.M2";

gpio29.$name                = "CONFIG_IOL_ENL5";
gpio29.pinDir               = "OUTPUT";
gpio29.GPIO.gpioPin.rx      = false;
gpio29.GPIO.gpioPin.$assign = "ball.F5";

gpio30.$name                = "CONFIG_IOL_ENL6";
gpio30.pinDir               = "OUTPUT";
gpio30.GPIO.gpioPin.rx      = false;
gpio30.GPIO.gpioPin.$assign = "ball.P1";

gpio31.$name                = "CONFIG_IOL_ENL7";
gpio31.pinDir               = "OUTPUT";
gpio31.GPIO.gpioPin.rx      = false;
gpio31.GPIO.gpioPin.$assign = "ball.P2";

gpio32.$name                = "CONFIG_IOL_ENL8";
gpio32.pinDir               = "OUTPUT";
gpio32.GPIO.gpioPin.rx      = false;
gpio32.GPIO.gpioPin.$assign = "ball.T4";

gpio33.$name                = "CONFIG_GPIO_LED_STATUS";
gpio33.pinDir               = "OUTPUT";
led1.peripheralDriver       = gpio33;
gpio33.GPIO.gpioPin.rx      = false;
gpio33.GPIO.gpioPin.$assign = "ball.U19";

gpio34.$name                = "CONFIG_GPIO_LED_ERROR";
gpio34.pinDir               = "OUTPUT";
led2.peripheralDriver       = gpio34;
gpio34.GPIO.gpioPin.rx      = false;
gpio34.GPIO.gpioPin.$assign = "ball.B13";

gpio35.$name                = "CONFIG_GPIO0_PHY0_RESET";
gpio35.pinDir               = "OUTPUT";
led3.peripheralDriver       = gpio35;
gpio35.GPIO.$assign         = "GPIO0";
gpio35.GPIO.gpioPin.rx      = false;
gpio35.GPIO.gpioPin.$assign = "ball.Y19";

gpio36.$name                = "CONFIG_GPIO0_PHY1_RESET";
gpio36.pinDir               = "OUTPUT";
led4.peripheralDriver       = gpio36;
gpio36.GPIO.$assign         = "GPIO0";
gpio36.GPIO.gpioPin.rx      = false;
gpio36.GPIO.gpioPin.$assign = "ball.Y15";

i2c1.$name            = "CONFIG_I2C0";
led5.peripheralDriver = i2c1;
i2c1.I2C.$assign      = "I2C0";

i2c2.$name             = "CONFIG_I2C1";
led6.peripheralDriver  = i2c2;
led7.peripheralDriver  = i2c2;
led8.peripheralDriver  = i2c2;
led9.peripheralDriver  = i2c2;
led10.peripheralDriver = i2c2;
led11.peripheralDriver = i2c2;
led12.peripheralDriver = i2c2;
led13.peripheralDriver = i2c2;
led14.peripheralDriver = i2c2;
led15.peripheralDriver = i2c2;
led16.peripheralDriver = i2c2;
led17.peripheralDriver = i2c2;
led18.peripheralDriver = i2c2;
led19.peripheralDriver = i2c2;
led20.peripheralDriver = i2c2;
led21.peripheralDriver = i2c2;
i2c2.I2C.$assign       = "I2C1";
i2c2.I2C.SCL.$assign   = "ball.A17";
i2c2.I2C.SDA.$assign   = "ball.B18";

mcspi1.$name                 = "CONFIG_MCSPI_IOL";
mcspi1.mcspiChannel[0].$name = "CONFIG_MCSPI_CH0";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
pruicss1.iepSyncMode                     = scripting.forceWrite(true);
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

uart1.$name            = "CONFIG_UART_SMI";
uart1.readMode         = "CALLBACK";
uart1.readCallbackFxn  = "vUartRxCallback";
uart1.writeMode        = "CALLBACK";
uart1.writeCallbackFxn = "vUartTxCallback";
uart1.UART.$assign     = "USART0";
uart1.UART.RXD.$assign = "ball.B10";
uart1.UART.TXD.$assign = "ball.B11";

uart2.$name            = "CONFIG_UART_CONSOLE";
uart2.UART.$assign     = "USART1";
uart2.UART.RXD.$assign = "ball.B12";
uart2.UART.TXD.$assign = "ball.A12";

